Revit 2027 API
BuiltInFailures.BendFailures.NotBentDetailComponent Property
 While making curved beam type "[Type Name]" 2D Detail Component elements were not created
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NotBentDetailComponent { get; }
Public Shared ReadOnly Property NotBentDetailComponent As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NotBentDetailComponent {
	FailureDefinitionId^ get ();
}
static member NotBentDetailComponent : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.BendFailures Class
Autodesk.Revit.DB Namespace